app/controllers/trails_controller.rb

SELECT  "trails".* FROM "trails" WHERE "trails"."latitude" = $1 AND "trails"."longitude" = $2 ORDER BY "trails"."id" ASC LIMIT $3  [["latitude", 40.1108], ["longitude", -105.7463], ["LIMIT", 1]]
---
  def search
    render json: {status: :error, message: 'lat and lon must be present'} and return if params[:lat].blank? || params[:lon].blank?

    lat = params[:lat]
    lon = params[:lon]
    radius = params[:radius]

    fetched_cache = Trail.where({latitude: params[:lat], longitude: params[:lon]}).first